# 怎么在pandas使用function?



#### map
#### apply

In [1]:
import pandas as pd

In [9]:
user = pd.read_table('https://raw.githubusercontent.com/intohole/pandas-videos/master/data/u.user',sep = "|",header = None, names = ['id','age','sex','job','zip_code'] )

In [10]:
user.head()

   id  age sex         job zip_code
0   1   24   M  technician    85711
1   2   53   F       other    94043
2   3   23   M      writer    32067
3   4   24   M  technician    43537
4   5   33   F       other    15213

In [12]:
user['sex_index'] = user.sex.map({'M':1,'F':0})

In [13]:
user.head()

   id  age sex         job zip_code  sex_index
0   1   24   M  technician    85711          1
1   2   53   F       other    94043          0
2   3   23   M      writer    32067          1
3   4   24   M  technician    43537          1
4   5   33   F       other    15213          0

In [15]:
user['job_name_len'] = user.job.apply(len)

In [16]:
user.head()

   id  age sex         job zip_code  sex_index  job_name_len
0   1   24   M  technician    85711          1            10
1   2   53   F       other    94043          0             5
2   3   23   M      writer    32067          1             6
3   4   24   M  technician    43537          1            10
4   5   33   F       other    15213          0             5

In [20]:
user.dtypes

id               int64
age              int64
sex             object
job             object
zip_code        object
sex_index        int64
job_name_len     int64
dtype: object

In [17]:
def zip_code_change(zip_code,num = 2):
    return zip_code % num

In [23]:
user['len_fn'] = user.job_name_len.apply(zip_code_change,num = 3)